{
  "cid": 6,
  "lastposttime": 1638854149252,
  "mainPid": 1157,
  "postcount": 1,
  "slug": "268/virtual-dweb-holiday-fair-in-gather-town",
  "tid": 268,
  "timestamp": 1638854149252,
  "title": "Virtual DWeb Holiday Fair in Gather.town",
  "uid": 24,
  "viewcount": 361,
  "postercount": 1,
  "tags": [],
  "deleted": 0,
  "locked": 0,
  "pinned": 0,
  "pinExpiry": 0,
  "upvotes": 0,
  "downvotes": 0,
  "deleterUid": 0,
  "titleRaw": "Virtual DWeb Holiday Fair in Gather.town",
  "timestampISO": "2021-12-07T05:15:49.252Z",
  "scheduled": false,
  "lastposttimeISO": "2021-12-07T05:15:49.252Z",
  "pinExpiryISO": "",
  "votes": 0,
  "teaserPid": null,
  "thumbs": [],
  "posts": [
    {
      "content": "<p dir=\"auto\">För er som är intresserade att fundera över teknikens möjligheter annordnas en julmarknad där man kan vandra runt och insupa ideer om <strong>vad WEB:en skulle kunna vara</strong>  länk <a href=\"https://www.eventbrite.com/e/dweb-holiday-fair-dec-2021-meetup-tickets-218423960947\" rel=\"nofollow ugc\">anmälan</a> Wed, December 8, 20217:00 PM – 8:30 PM CET dvs. <a href=\"https://www.eventbrite.com/e/dweb-holiday-fair-dec-2021-meetup-tickets-218423960947#add-to-calendar-modal\" rel=\"nofollow ugc\">19:00 svensk tid</a></p>\n<ul>\n<li><strong>min magkänsla idag</strong> är att myndigheter är väldigt sega och långsamma organisationer med <strong>mycket fråga GD</strong> mentalitet där det då blir lite pannkaka som jag kände det blev med <a href=\"https://community.dataportal.se/topic/243/textdata-och-delning-av-statliga-utredningar-f%C3%B6r-maskinell-analys/7\">PDF diskussionen</a> eller blir med vilket <a href=\"https://community.dataportal.se/topic/202/%C3%B6nskem%C3%A5l-ny-rekommendation-fr%C3%A5n-digg-om-api-ers-koordinatsystem\">koordinatsystem som skall användas</a> för öppna data, eller ingen vågar prata <a href=\"https://www.youtube.com/watch?v=mmQl6VGvX-c\" rel=\"nofollow ugc\">kunskapsgrafer</a>.... PDF kom 1983 och WGS84 har till och med året 1984 i namnet, <a href=\"https://en.wikipedia.org/wiki/Knowledge_graph\" rel=\"nofollow ugc\">kunskapsgrafer</a> kom 1972.... känns som vi ligger 40 år fel i våra diskussioner... Nedan lite framkant vad tekniken kan, min tro är att <strong>med rätt personer i förarsätet kan detta bli bra</strong>....</li>\n</ul>\n<p dir=\"auto\"><img src=\"/assets/uploads/files/1638837855117-76c8dd59-b41c-417e-a742-1d18ba612309-image.png\" alt=\"76c8dd59-b41c-417e-a742-1d18ba612309-image.png\" class=\" img-fluid img-markdown\" /></p>\n<p dir=\"auto\"><strong>Explore the Holiday Booths:</strong><br />\n<a href=\"https://agregore.mauve.moe/\" rel=\"nofollow ugc\">Agregore</a> is a minimal web browser for the distributed <a href=\"http://web.It\" rel=\"nofollow ugc\">web.It</a> integrates peer to peer protocols with the web to simplify creating and sharing apps without the internet. Our goal is to make local-first software easy to make, and to make technology more resilient and easier to make.</p>\n<p dir=\"auto\"><a href=\"https://matrix.to/#/#dweb-space:matrix.dweb-lab.com\" rel=\"nofollow ugc\">Anwen/Dweb Lab</a> - Dweb Lab. Dweb Search. Dweb content community. Dwebverse: open-source mmo 3d &amp; vr game</p>\n<p dir=\"auto\"><a href=\"https://twitter.com/pfrazee\" rel=\"nofollow ugc\">Blue Link Labs &amp; Paul Frazee</a> is developing new project building a decentralized, self-hostable cloud using Hypercore Protocol and other Web3 technologies</p>\n<p dir=\"auto\"><a href=\"https://briarproject.org/\" rel=\"nofollow ugc\">Briar</a> - Briar is a messaging app designed for activists, journalists, and anyone else who needs a safe, easy and robust way to communicate. Unlike traditional messaging apps, Briar doesn’t rely on a central server - messages are synchronized directly between the users’ devices.</p>\n<p dir=\"auto\"><a href=\"https://www.decentralizedfuturecouncil.org/\" rel=\"nofollow ugc\">Decentralized Future Council</a> -The Decentralized Future Council is a new initiative committed to educating policymakers in Washington about the future of decentralized and interoperable protocols that will transform the Internet as we know it.</p>\n<p dir=\"auto\"><a href=\"https://github.com/earthstar-project/earthstar\" rel=\"nofollow ugc\">Earthstar Project</a> - Earthstar is a P2P protocol and accompanying library of APIs for building collaborative and social applications, designed for human-sized (1-100) groups that already know and trust each other. Maybe you want an online space where you can just be yourself. Or someplace safe, where strangers won't hassle you. Maybe you want to build tools that are really tailor-made for your community, with a simple, blockchain-free API.</p>\n<p dir=\"auto\"><a href=\"https://equalit.ie/\" rel=\"nofollow ugc\">eQualitie</a> -eQualitie builds free and open source software built on decentralized infrastructure and protocols in support of free speech and access to knowledge. Come learn about <a href=\"https://censorship.no/en/index.html\" rel=\"nofollow ugc\">CENO (short for Censorship No!) Browser</a>, a mobile browser for storing and sharing blocked web content, as well as the team's newest project, OuiSync - a tool for securely synchronizing and sharing files. Both projects have been developed with the backend support of the open source Ouinet library for enabling peer-to-peer functionality, which can be integrated into many other third-party applications. We would love to hear your feedback and ideas, and explore opportunities for collaborating!</p>\n<p dir=\"auto\"><a href=\"https://fil.org/\" rel=\"nofollow ugc\">Filecoin Foundation</a> - A representative of the Filecoin Foundation will be on hand to talk about our grants program. With our grants, we seek to: A) Accelerate the adoption of open, decentralized technologies; B) Build communities of practitioners, users, and champions that are mutually supporting and self-sustaining; C) Communicate the values and benefits of open, decentralized technologies to wider audiences</p>\n<p dir=\"auto\"><a href=\"https://ffdweb.org/\" rel=\"nofollow ugc\">Filecoin Foundation for the Decentralized Web</a> - FFDW is proud to financially support the Internet Archive, and many of the projects you see around at this fair! Talk to our team about a vision for a better, re-decentralized internet, and how we might be able to help you.</p>\n<p dir=\"auto\"><a href=\"https://fluence.network/\" rel=\"nofollow ugc\">Fluence Labs</a> - Fluence is a peer-to-peer application platform which allows the creation of applications free of proprietary cloud providers or centralized APIs. Fluence provides a peer-to-peer development stack so that you can program p2p applications, workflows, and compose services, APIs without relying on centralized intermediaries. Fluence’s p2p platform provides a complementary compute layer to IPFS, enabling a wide variety of decentralized use cases.</p>\n<p dir=\"auto\"><a href=\"https://www.namebase.io/\" rel=\"nofollow ugc\">Handshake</a> - Handshake is a naming protocol that’s backwards compatible with the existing DNS system. Every peer in the Handshake network cryptographically validates and manages the root zone, which completely removes the need for the Certificate Authority system (CAs). Names are logged on the Handshake blockchain, which is essentially one big distributed zone file to which anyone can add an entry.</p>\n<p dir=\"auto\"><a href=\"https://www.hyperhyperspace.org/\" rel=\"nofollow ugc\">Hyper Hyper Space</a> - The Hyper Hyper Space project aims to decentralized applications easy to build and accessible by everyone. Come power your Dapps with data objects that can be instantiated anywhere (even inside a web browser), used offline and easily synchronized over the net!</p>\n<p dir=\"auto\"><a href=\"https://imagesnippets.com/\" rel=\"nofollow ugc\">ImageSnippets</a> - discussing metadata delivery service layers around art/imagery within the context of decentralized protocols.</p>\n<p dir=\"auto\"><a href=\"https://github.com/rolandosborne/IndiView\" rel=\"nofollow ugc\">Indi View</a> - As a personal interest project in privacy, I built an app and a decentralized network for communicating with friends and family. The network node is designed for self-hosting and implements a digital identity API. The mobile app supports sharing of contact details, photos, videos and chatting through the network.</p>\n<p dir=\"auto\"><a href=\"https://archive.org/\" rel=\"nofollow ugc\">Internet Archive</a> - The Internet Archive, the Library of Alexandria for the digital era, is <a href=\"https://dweb.archive.org/details/home\" rel=\"nofollow ugc\">experimenting</a> with storing web pages, film and audio in decentralized storage --at scale! Come meet our team lead, Arkadiy Kukarkin, as we expand our decentralized team.</p>\n<p dir=\"auto\"><a href=\"https://jolocom.io/\" rel=\"nofollow ugc\">Jolocom</a> - Own Your digital self. Our vision is to empower every individual, organization, and entity capable of identity to freely communicate. Jolocom provides universally accessible and useful solutions for decentralized identity management.</p>\n<p dir=\"auto\"><a href=\"https://leastauthority.com/\" rel=\"nofollow ugc\">Least Authority</a> - Least Authority is a technology company supporting people’s right to privacy through security consulting and building secure solutions. A leader in the security of distributed systems, Least Authority offers consulting services, develops privacy-enhancing products, and contributes to the advancement of related open source and human rights projects.</p>\n<p dir=\"auto\"><a href=\"https://mask.io/\" rel=\"nofollow ugc\">Mask Network</a> - Mask Network aims to bridge the Web 2.0 users to Web 3.0. By bringing the amazing decentralized application ecosystem onto traditional social networks, the Mask extension provides a decentralized option for features Web 2.0 users are familiar with. Users could enjoy secure, decentralized social messaging, payment networks, file storage, and file sharing without leaving the mainstream social media networks.</p>\n<p dir=\"auto\"><a href=\"https://matrix.org/\" rel=\"nofollow ugc\">Matrix Foundation</a> - The <a href=\"http://Matrix.org\" rel=\"nofollow ugc\">Matrix.org</a> Foundation is the Foundation responsible of the Matrix protocol and its healthy evolution. Matrix is a federated protocol which is mostly used for instant messaging, but not exclusively. One of the other applications is full mesh VoIP. The <a href=\"http://Matrix.org\" rel=\"nofollow ugc\">Matrix.org</a> Foundation is the Foundation responsible of the Matrix protocol and its healthy evolution. Matrix is a federated protocol which is mostly used for instant messaging, but not exclusively. One of the other applications is full mesh VoIP.</p>\n<p dir=\"auto\"><a href=\"https://www.colorado.edu/lab/medlab/\" rel=\"nofollow ugc\">Media Enterprise Design Lab</a>, University of Colorado - Nathan Schneider's CommunityRule is a governance toolkit for great communities. How does your community work? Are you ready to make hard decisions? Too often, we leave the most basic questions unstated and unanswered. CommunityRule makes it easier to clarify the basics so you can focus on other things.</p>\n<p dir=\"auto\">We'll be showcasing our prototype Web app and gathering ideas for our next-stage revision now in progress.</p>\n<p dir=\"auto\"><a href=\"https://www.mysterium.network/\" rel=\"nofollow ugc\">Mysterium Network</a> - Mysterium Network is an open-source, Swiss-based Web3 project making the internet borderless and accessible for all. Their decentralised ecosystem of protocols, tools and web infrastructure provides more privacy, anonymous expression, and equal access to information. The project’s flagship product, the decentralised Mysterium VPN, is available for Android, Windows and Mac. Anyone can join the peer-to-peer marketplace to rent their unused bandwidth and IP address to a global community.</p>\n<p dir=\"auto\"><a href=\"https://www.onecommons.org/\" rel=\"nofollow ugc\">OneCommons</a> - OneCommons is an early-stage startup dedicated to building a free and open cloud. Our open-source platform lets you build, share and fork open cloud services that are location independent and support built-in funding mechanisms. Our mission is to realign economic incentives so we can nudge the Web away from the Attention Economy -- based on maximizing a user's attention at whatever cost -- to an Intention Economy, where participants fund what they find worthy.</p>\n<p dir=\"auto\"><a href=\"https://peergos.org/\" rel=\"nofollow ugc\">Peergos</a> - Peergos is a p2p, E2EE secure file storage, social network and application protocol built on IPFS. Peergos is building the next web - the private web, where end users are in control. Imagine web apps being secure by default and unable to track you. Imagine being able to control exactly what personal data each web app can see. Imagine never having to log in to an app ever again. You own your data and decide where it is stored and who can see it.</p>\n<p dir=\"auto\"><a href=\"https://plan.tools/\" rel=\"nofollow ugc\">plan.tools</a> - PLAN 3D is a community-centric content creator platform for collaboration, world building, and immersive experiences. PLAN is bridging together previously siloed industries using distributed ledger technology (DLT), p2p infrastructure, 3D graphics, open protocols, and realtime collaboration interfaces. Our vision is that the future internet will be powered by collaborative spaces built on a framework that is community-centric, off-grid capable, inclusive, as well as private and secure by default.</p>\n<p dir=\"auto\"><a href=\"https://twitter.com/TheQuarkBrowser\" rel=\"nofollow ugc\">Quark</a> - Quark is the browser that shows you paths across the internet. We incentivize the expansion of Web 3.0 to users at large with an interaction design approach.</p>\n<p dir=\"auto\">Imagine if you can bump into people looking at similar online content or search results, see where they’ve been, tag along to discover content together, and even monetize it via live stream. With Quark, you can build a collective map of the internet.</p>\n<p dir=\"auto\"><a href=\"https://sher.geutstudio.com/\" rel=\"nofollow ugc\">SHER</a> - the decentralized live audio platform. That's right, with SHER you can create your own shows. Have multiple streamers, play files and more. You don't have to install anything, it works on your browser! Take the broadcast studio with you.</p>\n<p dir=\"auto\"><a href=\"https://siasky.net/\" rel=\"nofollow ugc\">Skynet Labs</a> - Skynet is an open protocol for hosting data and web applications on the decentralized web using the Sia blockchain. Skynet decentralizes \"the cloud\" so that user and application data is not stored by (and only accessible to) a single, central authority and allows users to access it without any specialized software or cryptocurrency.</p>\n<p dir=\"auto\"><a href=\"https://www.socialroots.io/\" rel=\"nofollow ugc\">Socialroots</a> -- Wicked Co-op LCA is an NSF funded worker owned co-op building enabling software technology for DAOs and decentralized networks of organizations to coordinate more effectively. Our platform, <a href=\"https://www.socialroots.io/\" rel=\"nofollow ugc\">Socialroots</a>, enables functional cross-group communication, decreasing the time it takes to manage work and partnerships, and increasing engagement and productivity.</p>\n<p dir=\"auto\"><a href=\"https://www.starlinglab.org/\" rel=\"nofollow ugc\">Starling Lab</a> - The USC | Stanford Starling Lab is the first academic research center in the world dedicated to exploring how Web3 technology can transform human rights. We work with historians, journalists, lawyers to securely capture, store, and verify human history using decentralized technologies.</p>\n<p dir=\"auto\"><a href=\"https://sutty.coop.ar/en/\" rel=\"nofollow ugc\">Sutty</a> - We're a worker-owned cooperative developing a FLOSS platform for managing and hosting static websites and e-commerce. We work for and with NGOs and grass-root organizations in Latin America and we want to share with you why we think this is an opportunity for DWeb's growth!</p>\n<p dir=\"auto\"><a href=\"https://www.virtualchair.net/\" rel=\"nofollow ugc\">Virtual Chair</a> - Virtual Chair facilitates the organization of efficient and effective virtual events by focusing on three priorities: interaction among participants, dissemination of materials, and broadening participation. With Virtual Chair, organizers can easily take full advantage of best practices for virtual events.</p>\n<p dir=\"auto\"><a href=\"https://webrecorder.net/\" rel=\"nofollow ugc\">Webrecorder</a> - Webrecorder's goal is to make it easier for anyone to create, store and access web archives using open source tools. One of our current efforts, supported by the FIlecoin Foundation, is to standardize a format that can be used to create and render web archives directly in the browser. The format makes it possible to load web archives from IPFS as well as a local file system, or any online storage, decentralized or centralized. Webrecorder's motto is \"web archiving for all\" and we are working on several tools to enable decentralized web archiving using the browser itself, allow anyone to create personalized archives of their own web browsing.</p>\n",
      "pid": 1157,
      "tid": 268,
      "timestamp": 1638854149252,
      "uid": 24,
      "edited": 1638854304943,
      "editor": {
        "uid": 0,
        "username": "[[global:former_user]]",
        "userslug": "",
        "oldUid": 24,
        "displayname": "[[global:former_user]]",
        "email": "",
        "icon:text": "?",
        "icon:bgColor": "#aaa",
        "groupTitle": "",
        "groupTitleArray": [],
        "status": "offline",
        "reputation": 0,
        "email:confirmed": 0,
        "picture": ""
      },
      "deleted": 0,
      "upvotes": 0,
      "downvotes": 0,
      "deleterUid": 0,
      "replies": {
        "hasMore": false,
        "hasSingleImmediateReply": false,
        "users": [],
        "text": "[[topic:one_reply_to_this_post]]",
        "count": 0
      },
      "bookmarks": 0,
      "votes": 0,
      "timestampISO": "2021-12-07T05:15:49.252Z",
      "editedISO": "2021-12-07T05:18:24.943Z",
      "index": 0,
      "user": {
        "uid": 0,
        "username": "[[global:former_user]]",
        "userslug": "",
        "reputation": 0,
        "postcount": 0,
        "topiccount": 0,
        "picture": "",
        "signature": "",
        "banned": false,
        "banned:expire": 0,
        "status": "offline",
        "lastonline": 0,
        "groupTitle": "",
        "mutedUntil": 0,
        "oldUid": 24,
        "displayname": "[[global:former_user]]",
        "email": "",
        "icon:text": "?",
        "icon:bgColor": "#aaa",
        "groupTitleArray": [],
        "email:confirmed": 0,
        "banned_until": 0,
        "banned_until_readable": "Not Banned",
        "muted": false,
        "selectedGroups": [],
        "custom_profile_info": []
      },
      "bookmarked": false,
      "upvoted": false,
      "downvoted": false,
      "selfPost": false,
      "events": [],
      "topicOwnerPost": true,
      "display_edit_tools": false,
      "display_delete_tools": false,
      "display_moderator_tools": false,
      "display_move_tools": false,
      "display_post_menu": true
    }
  ],
  "events": [],
  "category": {
    "bgColor": "#695f59",
    "cid": 6,
    "class": "col-md-3 col-xs-6",
    "color": "#ffffff",
    "description": "Diskutera och tipsa om möten, evenemang och tävlingar ",
    "descriptionParsed": "<p dir=\"auto\">Diskutera och tipsa om möten, evenemang och tävlingar</p>\n",
    "disabled": 0,
    "icon": "fa-ticket",
    "imageClass": "cover",
    "isSection": 0,
    "link": "",
    "name": "Meetups och evenemang",
    "numRecentReplies": 1,
    "order": 9,
    "parentCid": 0,
    "post_count": 462,
    "slug": "6/meetups-och-evenemang",
    "topic_count": 135,
    "subCategoriesPerPage": 10,
    "minTags": 0,
    "maxTags": 5,
    "postQueue": 0,
    "totalPostCount": 462,
    "totalTopicCount": 135
  },
  "tagWhitelist": [],
  "minTags": 0,
  "maxTags": 5,
  "thread_tools": [],
  "isFollowing": false,
  "isNotFollowing": true,
  "isIgnoring": false,
  "bookmark": null,
  "postSharing": [
    {
      "id": "facebook",
      "name": "Facebook",
      "class": "fa-facebook",
      "activated": true
    },
    {
      "id": "twitter",
      "name": "Twitter",
      "class": "fa-twitter",
      "activated": true
    }
  ],
  "deleter": null,
  "merger": null,
  "related": [],
  "unreplied": true,
  "icons": [],
  "privileges": {
    "topics:reply": false,
    "topics:read": true,
    "topics:schedule": false,
    "topics:tag": false,
    "topics:delete": false,
    "posts:edit": false,
    "posts:history": false,
    "posts:upvote": false,
    "posts:downvote": false,
    "posts:delete": false,
    "posts:view_deleted": false,
    "read": true,
    "purge": false,
    "view_thread_tools": false,
    "editable": false,
    "deletable": false,
    "view_deleted": false,
    "view_scheduled": false,
    "isAdminOrMod": false,
    "disabled": 0,
    "tid": "268",
    "uid": 0
  },
  "topicStaleDays": 60,
  "reputation:disabled": 0,
  "downvote:disabled": 1,
  "feeds:disableRSS": 0,
  "signatures:hideDuplicates": 0,
  "bookmarkThreshold": 5,
  "necroThreshold": 7,
  "postEditDuration": 300,
  "postDeleteDuration": 0,
  "scrollToMyPost": true,
  "updateUrlWithPostIndex": true,
  "allowMultipleBadges": true,
  "privateUploads": false,
  "showPostPreviewsOnHover": true,
  "rssFeedUrl": "/topic/268.rss",
  "postIndex": 1,
  "breadcrumbs": [
    {
      "text": "[[global:home]]",
      "url": "/"
    },
    {
      "text": "[[global:header.categories]]",
      "url": "/categories"
    },
    {
      "text": "Meetups och evenemang",
      "url": "/category/6/meetups-och-evenemang",
      "cid": 6
    }
  ],
  "pagination": {
    "prev": {
      "page": 1,
      "active": false
    },
    "next": {
      "page": 1,
      "active": false
    },
    "first": {
      "page": 1,
      "active": true
    },
    "last": {
      "page": 1,
      "active": true
    },
    "rel": [],
    "pages": [],
    "currentPage": 1,
    "pageCount": 1
  },
  "loggedIn": false,
  "loggedInUser": {
    "uid": 0,
    "username": "[[global:guest]]",
    "picture": "",
    "icon:text": "?",
    "icon:bgColor": "#aaa"
  },
  "relative_path": "",
  "template": {
    "name": "topic",
    "topic": true
  },
  "url": "/topic/268",
  "bodyClass": "page-topic page-topic-268 template-topic page-topic-category-6 page-topic-category-meetups-och-evenemang parent-category-6 page-status-200 theme-harmony user-guest",
  "_header": {
    "tags": {
      "meta": [
        {
          "name": "viewport",
          "content": "width&#x3D;device-width, initial-scale&#x3D;1.0"
        },
        {
          "name": "content-type",
          "content": "text/html; charset=UTF-8",
          "noEscape": true
        },
        {
          "name": "apple-mobile-web-app-capable",
          "content": "yes"
        },
        {
          "name": "mobile-web-app-capable",
          "content": "yes"
        },
        {
          "property": "og:site_name",
          "content": "Community på Sveriges dataportal"
        },
        {
          "name": "msapplication-badge",
          "content": "frequency=30; polling-uri=https://community.dataportal.se/sitemap.xml",
          "noEscape": true
        },
        {
          "name": "theme-color",
          "content": "#ACB3A8"
        },
        {
          "name": "keywords",
          "content": "öppna data,api,open data,innovation,dataportal,community,forum"
        },
        {
          "name": "msapplication-square150x150logo",
          "content": "/assets/uploads/system/site-logo.svg",
          "noEscape": true
        },
        {
          "name": "title",
          "content": "Virtual DWeb Holiday Fair in Gather.town"
        },
        {
          "name": "description",
          "content": "För er som är intresserade att fundera över teknikens möjligheter annordnas en julmarknad där man kan vandra runt och insupa ideer om vad WEB:en skulle kunna vara  länk anmälan Wed, December 8, 20217:00 PM – 8:30 PM CET dvs. 19:00 svensk tid  min magkänsl..."
        },
        {
          "property": "og:title",
          "content": "Virtual DWeb Holiday Fair in Gather.town"
        },
        {
          "property": "og:description",
          "content": "För er som är intresserade att fundera över teknikens möjligheter annordnas en julmarknad där man kan vandra runt och insupa ideer om vad WEB:en skulle kunna vara  länk anmälan Wed, December 8, 20217:00 PM – 8:30 PM CET dvs. 19:00 svensk tid  min magkänsl..."
        },
        {
          "property": "og:type",
          "content": "article"
        },
        {
          "property": "article:published_time",
          "content": "2021-12-07T05:15:49.252Z"
        },
        {
          "property": "article:modified_time",
          "content": "2021-12-07T05:18:24.943Z"
        },
        {
          "property": "article:section",
          "content": "Meetups och evenemang"
        },
        {
          "property": "og:image",
          "content": "https://community.dataportal.se/assets/uploads/files/1638837855117-76c8dd59-b41c-417e-a742-1d18ba612309-image.png",
          "noEscape": true
        },
        {
          "property": "og:image:url",
          "content": "https://community.dataportal.se/assets/uploads/files/1638837855117-76c8dd59-b41c-417e-a742-1d18ba612309-image.png",
          "noEscape": true
        },
        {
          "property": "og:image:width",
          "content": "1262"
        },
        {
          "property": "og:image:height",
          "content": "932"
        },
        {
          "property": "og:image",
          "content": "https://community.dataportal.se/assets/uploads/system/og-image.jpg",
          "noEscape": true
        },
        {
          "property": "og:image:url",
          "content": "https://community.dataportal.se/assets/uploads/system/og-image.jpg",
          "noEscape": true
        },
        {
          "property": "og:image:width",
          "content": "1600"
        },
        {
          "property": "og:image:height",
          "content": "555"
        },
        {
          "content": "https://community.dataportal.se/api/topic/268",
          "property": "og:url"
        }
      ],
      "link": [
        {
          "rel": "icon",
          "type": "image/x-icon",
          "href": "/assets/uploads/system/favicon.ico?v&#x3D;ri45v5qda1g"
        },
        {
          "rel": "manifest",
          "href": "/manifest.webmanifest",
          "crossorigin": "use-credentials"
        },
        {
          "rel": "search",
          "type": "application/opensearchdescription+xml",
          "title": "Community på Sveriges dataportal",
          "href": "/osd.xml"
        },
        {
          "rel": "apple-touch-icon",
          "href": "/assets/uploads/system/touchicon-orig.png"
        },
        {
          "rel": "icon",
          "sizes": "36x36",
          "href": "/assets/uploads/system/touchicon-36.png"
        },
        {
          "rel": "icon",
          "sizes": "48x48",
          "href": "/assets/uploads/system/touchicon-48.png"
        },
        {
          "rel": "icon",
          "sizes": "72x72",
          "href": "/assets/uploads/system/touchicon-72.png"
        },
        {
          "rel": "icon",
          "sizes": "96x96",
          "href": "/assets/uploads/system/touchicon-96.png"
        },
        {
          "rel": "icon",
          "sizes": "144x144",
          "href": "/assets/uploads/system/touchicon-144.png"
        },
        {
          "rel": "icon",
          "sizes": "192x192",
          "href": "/assets/uploads/system/touchicon-192.png"
        },
        {
          "rel": "prefetch",
          "href": "/assets/src/modules/composer.js?v&#x3D;ri45v5qda1g"
        },
        {
          "rel": "prefetch",
          "href": "/assets/src/modules/composer/uploads.js?v&#x3D;ri45v5qda1g"
        },
        {
          "rel": "prefetch",
          "href": "/assets/src/modules/composer/drafts.js?v&#x3D;ri45v5qda1g"
        },
        {
          "rel": "prefetch",
          "href": "/assets/src/modules/composer/tags.js?v&#x3D;ri45v5qda1g"
        },
        {
          "rel": "prefetch",
          "href": "/assets/src/modules/composer/categoryList.js?v&#x3D;ri45v5qda1g"
        },
        {
          "rel": "prefetch",
          "href": "/assets/src/modules/composer/resize.js?v&#x3D;ri45v5qda1g"
        },
        {
          "rel": "prefetch",
          "href": "/assets/src/modules/composer/autocomplete.js?v&#x3D;ri45v5qda1g"
        },
        {
          "rel": "prefetch",
          "href": "/assets/templates/composer.tpl?v&#x3D;ri45v5qda1g"
        },
        {
          "rel": "prefetch",
          "href": "/assets/language/sv/topic.json?v&#x3D;ri45v5qda1g"
        },
        {
          "rel": "prefetch",
          "href": "/assets/language/sv/modules.json?v&#x3D;ri45v5qda1g"
        },
        {
          "rel": "prefetch",
          "href": "/assets/language/sv/tags.json?v&#x3D;ri45v5qda1g"
        },
        {
          "rel": "prefetch stylesheet",
          "type": "",
          "href": "/assets/plugins/nodebb-plugin-markdown/styles/default.css"
        },
        {
          "rel": "prefetch",
          "href": "/assets/language/sv/markdown.json?v&#x3D;ri45v5qda1g"
        },
        {
          "rel": "stylesheet",
          "href": "https://community.dataportal.se/assets/plugins/nodebb-plugin-emoji/emoji/styles.css?v&#x3D;ri45v5qda1g"
        },
        {
          "rel": "canonical",
          "href": "https://community.dataportal.se/topic/268/virtual-dweb-holiday-fair-in-gather-town",
          "noEscape": true
        },
        {
          "rel": "alternate",
          "type": "application/rss+xml",
          "href": "/topic/268.rss"
        },
        {
          "rel": "up",
          "href": "https://community.dataportal.se/category/6/meetups-och-evenemang"
        },
        {
          "rel": "author",
          "href": "https://community.dataportal.se/user/"
        }
      ]
    }
  },
  "widgets": {
    "footer": [
      {
        "html": "<footer id=\"footer\" class=\"container footer\" style=\"margin-bottom:1em\">\r\n\t<div>\r\n<img src=\"https://community.dataportal.se/assets/uploads/files/finansieras_av_europeiskaunionen.png\" alt=\"Finansieras av Europeiska unionen logo\" width=\"200\" />\r\n\t\t\r\n\t</div>\r\n</footer>"
      }
    ],
    "header": [
      {
        "html": "<h1>Community på Sveriges dataportal</h1>"
      }
    ]
  }
}